backend/tests/load/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
    - duration: 30
      arrivalRate: 50
      name: "Spike test"
  processor: "./scenarios/auth-processor.js"
  plugins:
    expect: {}
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Auth Load Test"
    weight: 30
    flow:
      - post:
          url: "/auth/signup"
          json:
            email: "{{ $randomEmail() }}"
            password: "TestPassword123!"
            name: "{{ $randomString() }}"
          capture:
            - json: "$.userSub"
              as: "userSub"
      - think: 2
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "TestPassword123!"

  - name: "Projects Load Test"
    weight: 40
    flow:
      - function: "getAuthToken"
      - post:
          url: "/projects"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            name: "{{ $randomString() }}"
            description: "Load test project"
          capture:
            - json: "$.id"
              as: "projectId"
      - think: 1
      - get:
          url: "/projects"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/projects/{{ projectId }}"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "Tasks Load Test"
    weight: 30
    flow:
      - function: "getAuthToken"
      - function: "createProject"
      - post:
          url: "/projects/{{ projectId }}/tasks"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "{{ $randomString() }}"
            description: "Load test task"
            status: "pending"
          capture:
            - json: "$.id"
              as: "taskId"
      - think: 1
      - get:
          url: "/projects/{{ projectId }}/tasks"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - put:
          url: "/tasks/{{ taskId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            status: "completed"